["Where am I?","In the Village.","What do you want?","Information.","Whose side are you on?","That would be telling. We want information… information… information.","You won't get it.","By hook or by crook, we will.","Who are you?","The new Number Two.","Who is Number One?","You are Number Six.","I am not a number! I am a free man!","[laughs]","I will not make any deals with you.  I've resigned.  I will not be pushed, filed, stamped, indexed, briefed, debriefed, or numbered! My life is my own!","Quite a beautiful place, really, isn't it? Almost like a world on its own.","I shall miss it when I'm gone.","Oh, it will grow on you.","A game of chess, my dear.","I don't play.","You should learn. We're all pawns, my dear.","Questions are a burden to others; answers a prison for oneself.","I am not a number. I am a person.","Six of one, half dozen of another.","Elections? In this place?","Of course--we make our choice every 12 months. Every citizen has a choice. Are you going to run?","Like blazes, the first chance I get.","I meant run for office.","Whose?","Mine, for instance.","You have a very delicate sense of humor.","Naturally. Humor is the very essence of a democratic society.","What physically happens if I win?!","You're the boss.","Number One's the boss.","Join me. [They enter Number Six's house] If you win Number One will no longer be a mystery to you, if you know what I mean. Anyway, I'll introduce you properly and see how you feel after assessing the madding crowd.","Gave up sugar four years and three months ago on medical advice. That shows you're afraid.","What?","You're afraid of death.","I'm afraid of nothing.","You're afraid of yourself. You are aware of that? Good, you are honest. That is of use here. Honesty attracts confidence and confidences are the core of our business.","How will you handle your campaign?","No comment.","Intends to fight for freedom at all costs.","Smile","How about your internal policy?","No comment.","Will tighten up on Village security.","Smile!","What about your external policy?","No comment.","Our exports will operate in every corner of the globe. How do you feel about life and death?","Mind your own business.","No comment.","There are those who come in here and deny that we can supply every conceivable civilised amenity within our boundaries. You can enjoy yourselves and you will. You can partake of the most hazardous sports and you will. The price is cheap. All you have to do in exchange is give us information. You are then eligible for promotion to other and perhaps more attractive spheres. Where do you desire to go? What has been your dream? I can supply it. Winter, spring, summer or fall--they can all be yours at any time. Apply to me and it will be easier and better.","I have a choice?","Of course. You can do as you want.","As long as it's what you want.","As long as it is what the majority wants. We're democratic. In some ways.","I'm sad, Number Six. I thought you were beginning to...","Give in?","Be happy. Everything you want is here.","Everything's elsewhere.","What were you looking at?","A light.","A star.","A boat.","An insect.","A plane.","A flying fish.","Somebody who belongs to my world.","This is your world. I am your world. If you insist on living a dream you may be taken for mad.","I like my dream.","Then you are mad.","Our legal system is unusual.","No jury.","Three judges decide here.","As in the French Revolution.","They cut through the dead wood, didn't they?","It's the rules. Of the people, by the people, for the people.","It takes on a new meaning.","You're a wicked man.","Wicked?","You have no values.","Different values.","You won't be helped.","Destroyed.","You want to spoil things.","I won't be a goldfish in a bowl.","[referring to the chess game] Why do you use people?","Some psychiatrists say it satisfies the desire for power. The only opportunity one gets here.","That depends what side you're on.","I'm on my side.","Aren't we all?","You must be new here. In time, most of us join the enemy... against ourselves.","Oh, that was a good move, wasn't it?","I know a better one.","Oh?","Away from this place.","That's impossible.","For chessmen, not for me.","Don't tell me you care?","Well, of course. We want you to be happy.","Fine. Just, umm... give me a one-way ticket home.","Won't you ever give up?","What do you think?","[about Number Six] Is he in for treatment?","Not yet.","Pity... interesting subject. I should like to know his breaking point.","Well, you could make that your life's ambition.","[crying] How can you doubt me?","It's easy and I'm waterproof; a little drizzle won't wash away my doubt. So don't try.","I only want to be near you.","Everybody's near in this place. Far too near.","Do you think they'll ever release us?","Let me know. I shan't be around.","[about Number Six] He can make even the act of putting on his dressing gown appear as a gesture of defiance.","Number Two's Assistant: There are methods we haven't used yet, of course.","I want him with a whole heart, body and soul.","Number Two's Assistant: He'll crack.","Perhaps--one tiny piece at a time. I don't want a man of fragments. Fascinating.","Number Two's Assistant: He doesn't even bend a little.","That's why he'll break. He only needs one small thing. If he will answer one simple question, the rest will follow: why did he resign?","[offering coffee] I can never remember. One lump or two?","It's in the file.","Yes, as a matter of fact, yes. But it would save time if you just answered.","Why? Running out of time?","Does not take sugar. Frightened of putting on weight?","No. Nor of being reduced.","Oh, that's excellent. I am glad you are here. You really are a model.","But I don't run on clockwork.","You will, my dear chap. You will.","Do you still think you can escape, Number Six?","I'm going to do better than that.","Oh?","Going to escape, come back.","Come back?","Escape, come back, wipe this place off the face of the Earth, obliterate it and you with it.","[Number Two shouts to Number Six as he walks out of his office]","Don't worry, Number Six.  You'll be cured.  I'll see to it. No more nightmares.  If you have so much as a bad dream, you will come… whimpering… to tell it to me!","[The door closes behind Number Six as he leaves]"," Whimpering!","Has it ever occurred to you that you are just as much a prisoner as I am?","Oh my dear chap, of course--I know too much. We're both lifers. Number Two: I am definitely an optimist. That's why it doesn't matter who Number One is. It doesn't matter which side runs the Village.","It's run by one side or the other.","Oh certainly, but both sides are becoming identical. What in fact has been created is an international community--perfect blueprint for world order. When the sides facing each other suddenly realize that they're looking into a mirror, they will see that this is the pattern for the future.","The whole Earth as the Village?","That is my hope. What's yours?","I'd like to be the first man on the moon.","[viewing Number Six's thoughts] Extraordinary. How very single-minded.","He's not conventional.","I sometimes think he's not human.","News of old friends travels quickly.","In a few hours.","To you and to me, news is like air. We breathe it deeply. We draw it from far and wide.","If it's interesting.","What are you going to do with your freedom?","Go fishing.","Perhaps you're fishing now.","What's that Number Six doing? Always walking. Irritating man. Doesn't he ever get tired?!","And remember.. you're mine.","Really?","Be horrible to other women.","I promise.","Oh, thank you.","You don't believe it. A university-level degree in three minutes.","It's improbable.","But not impossible.","Nothing's impossible in this place.","You'll find the Professor most interesting.","Would I?","With an extraordinary range of knowledge.","The only subject I'm interested in is getting away from this place.","Exactly.","Who are you?","A cog in the machine.","I'll fix it, Number Six, so that you become aware that deliberate destruction of official property is a most serious offense. I must recommend the the full penalty.","Which is?","It could be imprisonment, could be a fine.","I'll take the fine.","Yes, I thought you might.","Allow me to introduce .. The General. All the professor's own work; he gave birth to it and loves it with a passionate love, probably hates it even more. That mass of circuits, my dear fellow, is as revolutionary as nuclear fission. No more wastage in schools: there's no more tedious learning by rote. A brilliantly devised course, delivered by a leading teacher, subliminally learned, checked, and corrected by an infallible authority. And what have we got?","A row of cabbages!","Indeed - knowledgeable cabbages.","[after Number Six stumped the machine, causing it to self destruct] What was the question?","It's insoluble, to man or machine.","What was it?","W - H - Y - Question mark.","Why?","Why?","The trouble with science is that it can be perverted.","You know what, why don't we settle this like gentlemen?","You're claiming to be a gentleman too?","Oh very good, very good indeed. That line is very worthy of me.","[to Number Six] I take it I'm supposed to go all fuzzy round the edges and run off into the distance screaming Who am I?","By the time we finish with him, he won't know whether he's Number Six or the cube root of infinity.","[to Alison; about Number Twelve] I am the original, he is the economy pack.","You're a stubborn fellow, Number Six.","James, you call me that once again and you're liable for a bout in hospital.","[to Number Six] You resign. You disappear. You return. You spin a yarn that Hans Christian Andersen would reject as a fairy tale.","And they're all... numbers? No names. No names at all?","Just numbers.","I see.","Numbers in a village that is a complete unit of our own society. A place to put people who can't be kept around. People who know too much or too little. A place with many means of breaking a man.","[about Number Six] Interesting fellow.","He's an old, old, old friend. Who never gives up.","Who are you?","Watchmaker's Daughter: I'm a number, just like you. Does it matter which?","How'd you get in?","Watchmaker's Daughter: The door was open.","Always is... to them, isn't it?","Watchmaker's Daughter: But I'm not one of them.","No. What do you want?","Watchmaker's Daughter: Help.","Go to the Town Hall. The Citizens' Council promises help and advice for everyone.","Watchmaker's Daughter: Their Citizen's Council.","As far as I'm concerned, what's theirs is yours.","Watchmaker's Daughter: I am not one of them.","No... no one is.","Good morning--I've brought you the activities prognosis you ordered.","Oh, good--how accurate are these? What is the percentage of right and wrong?","I'm afraid we don't know that.","Why not?","Well, twice we programmed our machines for a percentile appraisal of their own efficiencies. Each time they refused to give back the requested information.","Refused? How?","Simply by not returning the data to us.","They'll be wanting their own trade union next.","You refuse to understand. What I'm doing is for a principle. We are in this prison for life, all of us, but I have met no one here who has committed a crime. I protest in a manner they cannot ignore.","Some other way, then--not by an act of murder.","Assassination.","Call it what you like--the important matter is that the entire Village will be punished.","Maybe it is what they need to wake them up, to shake them out of their lethargy. To make them angry enough...","That's assuming they survive the punishment!","Tomorrow, after I've handed over office, I'm to be assassinated..","For assassinated, substitute executed.","Since it's arranged by my own people, you mean.","You don't mind?","Of course I mind. It's just that... well, I never thought it would happen to me.","It never does--to anybody. But it can be prevented.","Preventing is only postponing. You never understood us, Number Six. We never fail!","The Seal is the ceremony.","It's hollowed out, it's packed with explosives.","And before I hand it over to my successor...","It will be detonated by radio.","I can think of better ways to die.","And better causes to die for.","It is the duty of this Committee to deal with complaints.","Complaints?","Your complaints.","Well done. I have several.","Do carry on.","No time for tea?","No. Only your future.","All right, say you're a poet and you were composing, and you failed to hear Number Ten's greeting.","Neglect of social principle.","Poetry has a social value.","He's trying to divide us.","His intentions are obvious. To stop us from helping this unfortunate girl.","You're trying to undermine my rehabilitation. Disrupt my social progress!","Strange talk for a poet.","Reactionary!","Rebel!","Disharmonious!","There is a saying, The slowest mule is nearest to the whip.","And another. He who digs a pit will one day lie in it. Or is Number Two above investigation?","You still have a choice. You can still salvage your right to be individuals. Your rights to truth and free thought. Reject this false world of Number Two. Reject it. Now!","We have things to discuss.","About the girl you murdered?","Oh, never mind the girl. I want to talk about you.","You're wasting your time. Others have tried.","Amateurs.","You're professional. A professional sadist?","You are too strong. We'll see. Du musst amboss oder hammer sein.","You must be anvil or hammer.","I see you know your Goethe.","And you see me as the anvil?","Precisely. I am going to hammer you.","Music makes for a quiet mind.","Music begins where words leave off.","You destroyed me.","No.. you destroyed yourself. You destroyed yourself. A character flaw. You were afraid of your masters. A weak link in the chain of command waiting to be broken.","Don't tell them... don't report me.","I don't intend to. You are going to report yourself.","[taking the phone] I have to report a breakdown.. in control. Number Two needs to be replaced. Yes, this is Number Two reporting.","[watching as Number Six paces his flat] What sort of opinion would you form of that fellow?","Anybody who spends his time doing that must be rather stupid.","You couldn't be more wrong. Because he's our most interesting citizen from every point of view... particularly yours.","You're still as pompous as ever... Danvers.","Where did you get my name?","Jonathan Peregrine Danvers. Born in Bootle. Took elocution lessons. Came to London, joined the civil service in 1948 as a junior clerk, but moved to this department sometime later. Mainly at the request of the typing pool. Am I going to see Sir Charles? Well? Or would you prefer me to go on. I'm sure these gentlemen would be most intrigued to hear of your little jaunt to Paris in March 1958. Let me see now, what was her name...","If you really are who you say you are, you would not have expected me to keep it, would you?","No. It's a hopeless situation.","If I had kept it, I would have been very stupid. Silly.","You've made your point. I accept it.","But you overlooked one thing. Sentimental people are sometimes stupid. Very stupid.","I will do it... on certain conditions.","I'm sure they will be reasonable.","For once, I am dictating.","Heil.","Harmony? Never heard of it.","Not many people have, señor. it's sort of… exclusive.","So am I.","You turned in your badge.","And my gun.","What were your reasons?","My reasons.","You've already taken a job. With who?","[correcting] Whom with.","Number Twenty-Two: [to Number Six; her last words] I wish it had been real.","[to Mr. X] You are a born survivor. I am a born killer. We were made for each other, but I fear this is where it must end. Your reflexes cannot save you now.","[to Mr. X] I love you madly. I love the way the hair curls on the back of your neck. You'll make a beautiful corpse. I'm going to do you the honour of letting you die superbly.","Mountaineering rope. It would hold an elephant.","Mr. X: I must remember that next time I go climbing with one.","You see, when the rocket reaches London, you will be the first to know! Won't that be exciting?!?","Mr. X: I'll just go to pieces.","[about Number Six] That one wouldn't drop his guard with his own grandmother!","[on the phone] Why do you care?","I know your voice.","I have been here before. Why do you care?","You'll never know.","How?","Don't do that.","What?","Inquire.","What's your number? Your number--what is it?","Be careful.","One two, three, four, five, six seven?","Quiet!","Eight, nine ten, 11, 12, 13, 14, 15, 16?","You know who it was?","Yes, sir.","Who was it? [Six says nothing.] That is cowardice!","That's honour, sir.","We don't talk about such things.","You should teach it, sir.","You're a fool!","Yes, sir. Not a rat.","A rat?","Rat.","[turns to face Six] I'm a rat?!?","No, sir. I'm a fool. Not a rat.","Society...","Yes, sir?","Society is a place where people exist together.","Yes, sir.","That is civilization.","Yes, sir.","The lone wolf belongs in the wilderness.","Yes, sir.","You must not grow up to be a lone wolf.","No, sir.","You must conform.","Yes, sir.","It is my sworn duty to see that you do conform.","Yes, sir.","You will take six.","Six, sir?","Of the best.","I'm not guilty, sir.","Ten!","Twelve.","What?","Twelve, sir, so that I can remember.","[Number Six begins to violently come out of his hypnotic trance and attack Number Two. The Butler knocks him unconscious, and he and Number Two begin to re-hypnotize Six.]","I'm beginning to like him.","I am a man, not a unit of society.","We understand he survived the ultimate test. Then he must no longer be referred to as Number Six or a number of any kind. He has gloriously vindicated the right of the individual to be individual. And this Assembly rises to you... Sir.","Give it to me baby! Confess!","Oh Dad, I'm your baby Dad, do you owe your baby something Daddy?","Confess!","The bones is yours Dad! They came from you my Daddy.","Confess! Now you hep?","Hip, Dad, hip.","Confess!","And a hip bone.","Confess!","And a thigh bone.","Confess!","Shin bone, knee bone.","Confess!","Back bone. All yours Dad.","Youth, with its enthusiasms which rebels against any accepted norm must because it must--and we sympathize--it may wear flowers in its hair, bells on toes, But when the common good is threatened, when the function of society is endangered, such revolts must cease. They are non-productive and must be abolished.","New allegiances. Such is the price of fame.... and failure. Dear me, how sad. My Lords, Ladies and Gentleman, a most extraordinary thing happened to me on my way here. It has been my lot in the past to wield a not inconsiderable power. Nay, I have had the ear of statesmen, kings and princes of many lands. Governments have been swayed, policies defined and revolutions nipped in the bud at a word from me in the right place, and at a propitious time. Not surprising therefore, that this community should find a use for me. Not altogether by accident that one day I should be abducted, and wake up here amongst you. What is deplorable is that I resisted for so short a time. A fine tribute to your methods.","We are honoured to have with us a revolutionary of a different calibre. He has revolted. Resisted. Fought. Held fast. Maintained. Destroyed resistance. Overcome coercion. The right to be a Person, Someone, or Individual. We applaud his private war and concede that despite materialistic efforts he has survived intact and secure. All that remains is recognition of a Man."]